# 10 mins to learn Pandas

[十分钟搞定pandas](http://www.cnblogs.com/chaosimple/p/4153083.html)

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

---

## 1.Create Object

详情请参考 [Data Structure Intro Section](http://pandas.pydata.org/pandas-docs/stable/dsintro.html#dsintro)

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -2.128528  0.730516  0.739890  0.591151
2013-01-02  0.898003 -0.369102  0.545741 -0.008239
2013-01-03 -0.182511  0.632319  1.489056  0.171114
2013-01-04 -0.455393 -0.165455 -1.526940  1.869737
2013-01-05 -0.845402 -0.500368 -1.019309 -1.618274
2013-01-06  0.134862  0.475744 -1.585539  1.000327

In [5]:
df2 = pd.DataFrame({'A' : 1.,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D' : np.array([3] * 4, dtype='int32'),
                    'E' : pd.Categorical(["test", "train", "test", "train"]),
                    'F' : 'foo'  })
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [6]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [7]:
df2.A

0    1.0
1    1.0
2    1.0
3    1.0
Name: A, dtype: float64

---

## 2.Show Datas

详情请参考 [Basics Section](http://pandas.pydata.org/pandas-docs/stable/basics.html#basics)

In [8]:
df.head()

                   A         B         C         D
2013-01-01 -2.128528  0.730516  0.739890  0.591151
2013-01-02  0.898003 -0.369102  0.545741 -0.008239
2013-01-03 -0.182511  0.632319  1.489056  0.171114
2013-01-04 -0.455393 -0.165455 -1.526940  1.869737
2013-01-05 -0.845402 -0.500368 -1.019309 -1.618274

In [9]:
df.tail()

                   A         B         C         D
2013-01-02  0.898003 -0.369102  0.545741 -0.008239
2013-01-03 -0.182511  0.632319  1.489056  0.171114
2013-01-04 -0.455393 -0.165455 -1.526940  1.869737
2013-01-05 -0.845402 -0.500368 -1.019309 -1.618274
2013-01-06  0.134862  0.475744 -1.585539  1.000327

In [10]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [12]:
df.values

array([[-2.12852765,  0.7305164 ,  0.73988971,  0.59115085],
       [ 0.89800259, -0.36910222,  0.54574088, -0.00823863],
       [-0.18251143,  0.63231928,  1.48905569,  0.17111351],
       [-0.4553933 , -0.16545521, -1.52693982,  1.86973669],
       [-0.84540204, -0.50036792, -1.01930871, -1.61827395],
       [ 0.13486164,  0.47574406, -1.58553933,  1.00032746]])

In [13]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.429828  0.133942 -0.226184  0.334303
std    1.020011  0.541507  1.314540  1.168216
min   -2.128528 -0.500368 -1.585539 -1.618274
25%   -0.747900 -0.318190 -1.400032  0.036599
50%   -0.318952  0.155144 -0.236784  0.381132
75%    0.055518  0.593175  0.691353  0.898033
max    0.898003  0.730516  1.489056  1.869737

In [14]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -2.128528    0.898003   -0.182511   -0.455393   -0.845402    0.134862
B    0.730516   -0.369102    0.632319   -0.165455   -0.500368    0.475744
C    0.739890    0.545741    1.489056   -1.526940   -1.019309   -1.585539
D    0.591151   -0.008239    0.171114    1.869737   -1.618274    1.000327

``按轴进行排序``

In [15]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.591151  0.739890  0.730516 -2.128528
2013-01-02 -0.008239  0.545741 -0.369102  0.898003
2013-01-03  0.171114  1.489056  0.632319 -0.182511
2013-01-04  1.869737 -1.526940 -0.165455 -0.455393
2013-01-05 -1.618274 -1.019309 -0.500368 -0.845402
2013-01-06  1.000327 -1.585539  0.475744  0.134862

``按值进行排序``

In [16]:
df.sort_values('B')

                   A         B         C         D
2013-01-05 -0.845402 -0.500368 -1.019309 -1.618274
2013-01-02  0.898003 -0.369102  0.545741 -0.008239
2013-01-04 -0.455393 -0.165455 -1.526940  1.869737
2013-01-06  0.134862  0.475744 -1.585539  1.000327
2013-01-03 -0.182511  0.632319  1.489056  0.171114
2013-01-01 -2.128528  0.730516  0.739890  0.591151

---

## 3.Select

虽然标准的Python/Numpy的选择和设置表达式都能够直接派上用场，但是作为工程使用的代码，我们推荐使用经过优化的pandas数据访问方式： .at, .iat, .loc, .iloc 和 .ix

详情请参阅 [Indexing and Selecing Data](http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing)、[MultiIndex](http://pandas.pydata.org/pandas-docs/stable/advanced.html#advanced)、[Advanced Indexing](http://pandas.pydata.org/pandas-docs/stable/advanced.html#advanced)

选择单独列，返回一个Series

In [17]:
df['A']

2013-01-01   -2.128528
2013-01-02    0.898003
2013-01-03   -0.182511
2013-01-04   -0.455393
2013-01-05   -0.845402
2013-01-06    0.134862
Freq: D, Name: A, dtype: float64

通过[]进行选择，这将会对行进行切片

In [18]:
df[0:3]

                   A         B         C         D
2013-01-01 -2.128528  0.730516  0.739890  0.591151
2013-01-02  0.898003 -0.369102  0.545741 -0.008239
2013-01-03 -0.182511  0.632319  1.489056  0.171114

### 通过标签选择

使用标签来获取一个交叉的区域

In [19]:
df.loc[dates[0]]

A   -2.128528
B    0.730516
C    0.739890
D    0.591151
Name: 2013-01-01 00:00:00, dtype: float64

通过标签来在多个轴上进行选择

In [20]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01 -2.128528  0.730516
2013-01-02  0.898003 -0.369102
2013-01-03 -0.182511  0.632319
2013-01-04 -0.455393 -0.165455
2013-01-05 -0.845402 -0.500368
2013-01-06  0.134862  0.475744

标签切片

In [21]:
df.loc['20130102' : '20130104', ['A', 'B']]

                   A         B
2013-01-02  0.898003 -0.369102
2013-01-03 -0.182511  0.632319
2013-01-04 -0.455393 -0.165455

对于返回的对象进行维度缩减

In [22]:
df.loc['20130102', ['A', 'B']]

A    0.898003
B   -0.369102
Name: 2013-01-02 00:00:00, dtype: float64

获取一个标量

In [23]:
df.loc[dates[0], 'A']

-2.1285276459399576

快速访问一个标量（与上一个方法等价）

In [24]:
df.at[dates[0], 'A']

-2.1285276459399576

### 通过位置选择

通过传递数值进行位置选择

In [25]:
df.iloc[3]

A   -0.455393
B   -0.165455
C   -1.526940
D    1.869737
Name: 2013-01-04 00:00:00, dtype: float64

通过数值进行切片，与numpy/python中的情况类似

In [26]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.455393 -0.165455
2013-01-05 -0.845402 -0.500368

通过指定一个位置的列表，与numpy/python中的情况类似

In [27]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  0.898003  0.545741
2013-01-03 -0.182511  1.489056
2013-01-05 -0.845402 -1.019309

对行进行切片

In [28]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  0.898003 -0.369102  0.545741 -0.008239
2013-01-03 -0.182511  0.632319  1.489056  0.171114

对列进行切片

In [29]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  0.730516  0.739890
2013-01-02 -0.369102  0.545741
2013-01-03  0.632319  1.489056
2013-01-04 -0.165455 -1.526940
2013-01-05 -0.500368 -1.019309
2013-01-06  0.475744 -1.585539

获取特定的值

In [30]:
df.iloc[1, 1]

-0.36910221698690143

In [31]:
df.iat[1, 1]

-0.36910221698690143

### 布尔索引

用一个单独列的值来选择数据：

In [32]:
df[df.A > 0]

                   A         B         C         D
2013-01-02  0.898003 -0.369102  0.545741 -0.008239
2013-01-06  0.134862  0.475744 -1.585539  1.000327

使用where操作来选择数据：

In [33]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  0.730516  0.739890  0.591151
2013-01-02  0.898003       NaN  0.545741       NaN
2013-01-03       NaN  0.632319  1.489056  0.171114
2013-01-04       NaN       NaN       NaN  1.869737
2013-01-05       NaN       NaN       NaN       NaN
2013-01-06  0.134862  0.475744       NaN  1.000327

使用isin()方法来过滤：

In [34]:
df2 = df.copy()
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01 -2.128528  0.730516  0.739890  0.591151    one
2013-01-02  0.898003 -0.369102  0.545741 -0.008239    one
2013-01-03 -0.182511  0.632319  1.489056  0.171114    two
2013-01-04 -0.455393 -0.165455 -1.526940  1.869737  three
2013-01-05 -0.845402 -0.500368 -1.019309 -1.618274   four
2013-01-06  0.134862  0.475744 -1.585539  1.000327  three

In [35]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03 -0.182511  0.632319  1.489056  0.171114   two
2013-01-05 -0.845402 -0.500368 -1.019309 -1.618274  four

### 设置

设置一个新的列：

In [36]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

通过标签设置新的值：

In [39]:
df.at[dates[0], 'A'] = 0

通过位置设置新的值：

In [41]:
df.iat[0, 1] = 0

通过一个numpy数组设置一组新值：

In [43]:
df.loc[:, 'D'] = np.array([5] * len(df))
df

                   A         B         C  D
2013-01-01  0.000000  0.000000  0.739890  5
2013-01-02  0.898003 -0.369102  0.545741  5
2013-01-03 -0.182511  0.632319  1.489056  5
2013-01-04 -0.455393 -0.165455 -1.526940  5
2013-01-05 -0.845402 -0.500368 -1.019309  5
2013-01-06  0.134862  0.475744 -1.585539  5

通过where操作来设置新的值：

In [45]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D
2013-01-01  0.000000  0.000000 -0.739890 -5
2013-01-02 -0.898003 -0.369102 -0.545741 -5
2013-01-03 -0.182511 -0.632319 -1.489056 -5
2013-01-04 -0.455393 -0.165455 -1.526940 -5
2013-01-05 -0.845402 -0.500368 -1.019309 -5
2013-01-06 -0.134862 -0.475744 -1.585539 -5

---

## 4.缺失值处理

在pandas中，使用np.nan来代替缺失值，这些值将默认不会包含在计算中

详情请参阅：[Missing Data Section](http://pandas.pydata.org/pandas-docs/stable/missing_data.html#missing-data)

在pandas中，使用np.nan来代替缺失值，这些值将默认不会包含在计算中

reindex()方法可以对指定轴上的索引进行改变/增加/删除操作，这将返回原始数据的一个拷贝：、

In [50]:
# df1 = df.reindex(index=dates[0:4], columns==list(df.columns) + ['E'])
df1 = df.reindex(index=dates[0:4])
df1.loc[dates[0] : dates[1], 'E'] = 1
df1

                   A         B         C  D    E
2013-01-01  0.000000  0.000000  0.739890  5  1.0
2013-01-02  0.898003 -0.369102  0.545741  5  1.0
2013-01-03 -0.182511  0.632319  1.489056  5  NaN
2013-01-04 -0.455393 -0.165455 -1.526940  5  NaN

去掉包含缺失值的行：

In [51]:
df.dropna(how='any')

                   A         B         C  D
2013-01-01  0.000000  0.000000  0.739890  5
2013-01-02  0.898003 -0.369102  0.545741  5
2013-01-03 -0.182511  0.632319  1.489056  5
2013-01-04 -0.455393 -0.165455 -1.526940  5
2013-01-05 -0.845402 -0.500368 -1.019309  5
2013-01-06  0.134862  0.475744 -1.585539  5

对缺失值进行填充：

In [52]:
df1.fillna(value=5)

                   A         B         C  D    E
2013-01-01  0.000000  0.000000  0.739890  5  1.0
2013-01-02  0.898003 -0.369102  0.545741  5  1.0
2013-01-03 -0.182511  0.632319  1.489056  5  5.0
2013-01-04 -0.455393 -0.165455 -1.526940  5  5.0

对数据进行布尔填充：

In [53]:
pd.isnull(df1)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

---

## 5.相关操作

详情请参考 [Basic Section On Binary Ops](http://pandas.pydata.org/pandas-docs/stable/basics.html#basics-binop)

执行描述性统计：

In [54]:
df.mean()

A   -0.075074
B    0.012190
C   -0.226184
D    5.000000
dtype: float64

在其他轴上进行相同的操作：

在其他轴上进行相同的操作：

In [55]:
df.mean(1)

2013-01-01    1.434972
2013-01-02    1.518660
2013-01-03    1.734716
2013-01-04    0.713053
2013-01-05    0.658730
2013-01-06    1.006267
Freq: D, dtype: float64

对于拥有不同维度，需要对齐的对象进行操作。Pandas会自动的沿着指定的维度进行广播：

In [60]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [61]:
df.sub(s, axis='index')

                   A         B         C    D
2013-01-01       NaN       NaN       NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN
2013-01-03 -1.182511 -0.367681  0.489056  4.0
2013-01-04 -3.455393 -3.165455 -4.526940  2.0
2013-01-05 -5.845402 -5.500368 -6.019309  0.0
2013-01-06       NaN       NaN       NaN  NaN

### Apply

对数据应用函数

In [63]:
df.apply(np.cumsum)

                   A         B         C   D
2013-01-01  0.000000  0.000000  0.739890   5
2013-01-02  0.898003 -0.369102  1.285631  10
2013-01-03  0.715491  0.263217  2.774686  15
2013-01-04  0.260098  0.097762  1.247746  20
2013-01-05 -0.585304 -0.402606  0.228438  25
2013-01-06 -0.450443  0.073138 -1.357102  30

In [64]:
df.apply(lambda x: x.max() - x.min())

A    1.743405
B    1.132687
C    3.074595
D    0.000000
dtype: float64

### 直方图

详情请参考 [Histogramming and Discretization](http://pandas.pydata.org/pandas-docs/stable/basics.html#basics-discretization)

In [66]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    6
1    0
2    6
3    2
4    1
5    3
6    6
7    3
8    0
9    5
dtype: int32

In [67]:
s.value_counts()

6    3
3    2
0    2
5    1
2    1
1    1
dtype: int64

字符串方法

Series对象在其str属性中配备了一组字符串处理方法，可以很容易的应用到数组中的每个元素，如下段代码所示。

更多详情请参考：[Vectorized String Methods](http://pandas.pydata.org/pandas-docs/stable/text.html#text-string-methods)

In [68]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

---

## 6.合并

Pandas提供了大量的方法能够轻松的对Series，DataFrame和Panel对象进行各种符合各种逻辑关系的合并操作。

具体请参阅：[Merging section](http://pandas.pydata.org/pandas-docs/stable/merging.html#merging)

### Concat

In [70]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0  0.960039 -1.220641  0.375090 -1.344782
1  1.107196  1.572461 -0.061880 -1.248606
2 -0.246691  1.879222 -0.642615 -0.896952
3 -0.751268 -1.272980 -0.582762 -0.546126
4 -1.425619 -0.586508  0.755898  0.556970
5  2.873071 -0.443632  2.967620 -0.354731
6  0.017955  1.012599  2.535126 -1.006726
7 -0.073752  0.588043 -0.413232  0.407647
8 -1.602526 -0.721921  1.725866  1.862174
9 -0.425503  0.362048 -0.987228  1.875441

In [71]:
pieces = [df[:3], df[3:7], df[7:]]
pd.concat(pieces)

          0         1         2         3
0  0.960039 -1.220641  0.375090 -1.344782
1  1.107196  1.572461 -0.061880 -1.248606
2 -0.246691  1.879222 -0.642615 -0.896952
3 -0.751268 -1.272980 -0.582762 -0.546126
4 -1.425619 -0.586508  0.755898  0.556970
5  2.873071 -0.443632  2.967620 -0.354731
6  0.017955  1.012599  2.535126 -1.006726
7 -0.073752  0.588043 -0.413232  0.407647
8 -1.602526 -0.721921  1.725866  1.862174
9 -0.425503  0.362048 -0.987228  1.875441

Join 类似于SQL类型的合并，具体请参阅：[Database style joining](http://pandas.pydata.org/pandas-docs/stable/merging.html#merging-join)

In [76]:
left = pd.DataFrame({'key' : ['foo', 'foo'], 'lval' : "[1, 2]"})
right = pd.DataFrame({'key' : ['foo', 'foo'], 'rval' : [4, 5]})
left

   key    lval
0  foo  [1, 2]
1  foo  [1, 2]

In [74]:
right

   key  rval
0  foo     4
1  foo     5

In [78]:
pd.merge(left, right, on='key')

   key    lval  rval
0  foo  [1, 2]     4
1  foo  [1, 2]     5
2  foo  [1, 2]     4
3  foo  [1, 2]     5

Append 将一行连接到一个DataFrame上，具体请参阅 [Appending](http://pandas.pydata.org/pandas-docs/stable/merging.html#merging-concatenation)

In [79]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A', 'B', 'C', 'D'])
df

          A         B         C         D
0  1.393603 -0.602232 -1.067152  0.079378
1 -1.447290 -1.851328  0.002898 -0.009276
2 -0.501925 -0.222470  0.790689 -0.984749
3 -0.951460 -2.384615 -2.173509 -0.651006
4 -0.983766  0.687122 -1.058146 -0.161058
5 -0.050114 -0.909806  1.049473  0.822250
6 -0.950501 -0.948767  0.186080 -0.590356
7  0.225664  1.187600 -0.304404 -0.770046

In [83]:
s = df.iloc[3]
df.append(s, ignore_index=True)

          A         B         C         D
0  1.393603 -0.602232 -1.067152  0.079378
1 -1.447290 -1.851328  0.002898 -0.009276
2 -0.501925 -0.222470  0.790689 -0.984749
3 -0.951460 -2.384615 -2.173509 -0.651006
4 -0.983766  0.687122 -1.058146 -0.161058
5 -0.050114 -0.909806  1.049473  0.822250
6 -0.950501 -0.948767  0.186080 -0.590356
7  0.225664  1.187600 -0.304404 -0.770046
8 -0.951460 -2.384615 -2.173509 -0.651006

---

## 7.分组

对于”group by”操作，我们通常是指以下一个或多个操作步骤：
- （Splitting）按照一些规则将数据分为不同的组；
- （Applying）对于每组数据分别执行一个函数；
- （Combining）将结果组合到一个数据结构中；

详情请参阅：[Grouping section](http://pandas.pydata.org/pandas-docs/stable/groupby.html#groupby)

In [84]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],
                   'B' : ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
                   'C' : np.random.rand(8),
                   'D' : np.random.rand(8)})
df

     A      B         C         D
0  foo    one  0.464921  0.190055
1  bar    one  0.266842  0.360041
2  foo    two  0.209200  0.428903
3  bar  three  0.645153  0.188640
4  foo    two  0.305482  0.813634
5  bar    two  0.827255  0.112989
6  foo    one  0.074401  0.730043
7  foo  three  0.690906  0.452875

分组并对每个分组执行sum函数：

In [87]:
df.groupby('A').sum()

            C         D
A
bar  1.739250  0.661671
foo  1.744911  2.615510

通过多个列进行分组形成一个层次索引，然后执行函数：

In [88]:
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one    0.266842  0.360041
    three  0.645153  0.188640
    two    0.827255  0.112989
foo one    0.539322  0.920098
    three  0.690906  0.452875
    two    0.514683  1.242537

---

## 8.Reshaping

详情请参阅 [Hierarchical Indexing](http://pandas.pydata.org/pandas-docs/stable/advanced.html#advanced-hierarchical)、[Reshaping](http://pandas.pydata.org/pandas-docs/stable/reshaping.html#reshaping-stacking)

### Stack

In [90]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
                     ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]))
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
df = pd.DataFrame(np.random.rand(8, 2), index=index, columns=['A', 'B'])
df2 = df[:4]
df2

                     A         B
first second
bar   one     0.637096  0.423704
      two     0.409155  0.729476
baz   one     0.502500  0.498543
      two     0.645196  0.741601

In [91]:
stacked = df2.stack()
stacked

first  second
bar    one     A    0.637096
               B    0.423704
       two     A    0.409155
               B    0.729476
baz    one     A    0.502500
               B    0.498543
       two     A    0.645196
               B    0.741601
dtype: float64

In [93]:
stacked.unstack()

                     A         B
first second
bar   one     0.637096  0.423704
      two     0.409155  0.729476
baz   one     0.502500  0.498543
      two     0.645196  0.741601

In [95]:
stacked.unstack(1)

second        one       two
first
bar   A  0.637096  0.409155
      B  0.423704  0.729476
baz   A  0.502500  0.645196
      B  0.498543  0.741601

In [96]:
stacked.unstack(0)

first          bar       baz
second
one    A  0.637096  0.502500
       B  0.423704  0.498543
two    A  0.409155  0.645196
       B  0.729476  0.741601

数据透视表，详情请参阅：[Pivot Tables](http://pandas.pydata.org/pandas-docs/stable/reshaping.html#reshaping-pivot)

In [102]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
                   'B' : ['A', 'B', 'C'] * 4,
                   'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                   'D' : np.random.randn(12),
                   'E' : np.random.randn(12)})
df

        A  B    C         D         E
0     one  A  foo  0.688653 -0.849295
1     one  B  foo -0.748180 -1.411194
2     two  C  foo -1.182862 -2.824995
3   three  A  bar -0.957041  2.536881
4     one  B  bar -0.533673 -0.529721
5     one  C  bar -1.022814  0.089230
6     two  A  foo -0.399182  1.916024
7   three  B  foo -1.118349  0.882671
8     one  C  foo  0.171156 -1.835601
9     one  A  bar  1.460249 -0.078151
10    two  B  bar -0.096413 -0.148220
11  three  C  bar -1.092440 -0.698543

可以从这个数据中轻松的生成数据透视表：

In [104]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A  1.460249  0.688653
      B -0.533673 -0.748180
      C -1.022814  0.171156
three A -0.957041       NaN
      B       NaN -1.118349
      C -1.092440       NaN
two   A       NaN -0.399182
      B -0.096413       NaN
      C       NaN -1.182862

---

## 9.时间序列

Pandas在对频率转换进行重新采样时拥有简单、强大且高效的功能（如将按秒采样的数据转换为按5分钟为单位进行采样的数据）。这种操作在金融领域非常常见。

具体参考：[Time Series section](http://pandas.pydata.org/pandas-docs/stable/timeseries.html#timeseries)

In [108]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)
ts.resample('5Min').sum()

2012-01-01    25521
Freq: 5T, dtype: int32

时区表示：

In [109]:
rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D')
ts = pd.Series(np.random.randn(len(rng)), rng)
ts

2012-03-06   -0.143970
2012-03-07   -0.455957
2012-03-08   -0.654060
2012-03-09   -0.142278
2012-03-10   -1.021148
Freq: D, dtype: float64

In [111]:
ts_utc = ts.tz_localize('UTC')
ts_utc

2012-03-06 00:00:00+00:00   -0.143970
2012-03-07 00:00:00+00:00   -0.455957
2012-03-08 00:00:00+00:00   -0.654060
2012-03-09 00:00:00+00:00   -0.142278
2012-03-10 00:00:00+00:00   -1.021148
Freq: D, dtype: float64

时区转换：

In [112]:
ts_utc.tz_convert('US/Eastern')

2012-03-05 19:00:00-05:00   -0.143970
2012-03-06 19:00:00-05:00   -0.455957
2012-03-07 19:00:00-05:00   -0.654060
2012-03-08 19:00:00-05:00   -0.142278
2012-03-09 19:00:00-05:00   -1.021148
Freq: D, dtype: float64

时间跨度转换：

In [114]:
rng = pd.date_range('1/1/2012', periods=5,freq='M')
ts = pd.Series(np.random.randn(len(rng)), index=rng)
ts

2012-01-31   -0.381908
2012-02-29    1.119017
2012-03-31   -0.571456
2012-04-30    1.601391
2012-05-31    0.168860
Freq: M, dtype: float64

In [115]:
ps = ts.to_period()
ps

2012-01   -0.381908
2012-02    1.119017
2012-03   -0.571456
2012-04    1.601391
2012-05    0.168860
Freq: M, dtype: float64

In [116]:
ps.to_timestamp()

2012-01-01   -0.381908
2012-02-01    1.119017
2012-03-01   -0.571456
2012-04-01    1.601391
2012-05-01    0.168860
Freq: MS, dtype: float64

时期和时间戳之间的转换使得可以使用一些方便的算术函数。

In [117]:
prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')
ts = pd.Series(np.random.rand(len(prng)), prng)
ts.head()

1990Q1    0.414536
1990Q2    0.559000
1990Q3    0.228074
1990Q4    0.216711
1991Q1    0.707076
Freq: Q-NOV, dtype: float64

---

## 10.Categorical

从0.15版本开始，pandas可以在DataFrame中支持Categorical类型的数据，

详细介绍参看：[categorical introduction](http://pandas.pydata.org/pandas-docs/stable/categorical.html#categorical)、[API documentation](http://pandas.pydata.org/pandas-docs/stable/api.html#api-categorical)

In [118]:
df = pd.DataFrame({"id" : [1, 2, 3, 4, 5, 6], "raw_grade" : ['a', 'b', 'b', 'a', 'a', 'e']})

将原始的grade转换为Categorical数据类型：

In [119]:
df["grade"] = df["raw_grade"].astype("category")
df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

将Categorical类型数据重命名为更有意义的名称：

In [121]:
df["grade"].cat.categories = ["very good", "good", "very bad"]
df["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (3, object): [very good, good, very bad]

对类别进行重新排序，增加缺失的类别：

In [124]:
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium", "good"])
df["grade"]

0         NaN
1        good
2        good
3         NaN
4         NaN
5    very bad
Name: grade, dtype: category
Categories (4, object): [very bad, bad, medium, good]

排序是按照Categorical的顺序进行的而不是按照字典顺序进行：

In [126]:
df.sort_values("grade")

   id raw_grade     grade
0   1         a       NaN
3   4         a       NaN
4   5         a       NaN
5   6         e  very bad
1   2         b      good
2   3         b      good

对Categorical列进行排序时存在空的类别：

In [128]:
df.groupby("grade").size()

grade
very bad    1
bad         0
medium      0
good        2
dtype: int64

---

## 11.画图

具体文档参看：[Plotting docs](http://pandas.pydata.org/pandas-docs/stable/visualization.html#visualization)

In [131]:
ts = pd.Series(np.random.randn(1000), index=pd.date_range('1/1/2000', periods=1000))
ts = ts.cumsum()
ts.plot()

对于DataFrame来说，plot是一种将所有列及其标签进行绘制的简便方法：

In [132]:
df = pd.DataFrame(np.random.rand(1000, 4), index=ts.index, columns=['A', 'B', 'C', 'D'])
df = df.cumsum()
plt.figure(); df.plot(); plt.legend(loc='best')

In [133]:
df = pd.DataFrame(np.random.randn(1000, 4), index=ts.index, columns=['A', 'B', 'C', 'D'])
df = df.cumsum()
plt.figure(); df.plot(); plt.legend(loc='best')

---

## 12.导入和保存数据

- CSV： 参考 [Writing to a csv file](http://pandas.pydata.org/pandas-docs/stable/io.html#io-store-in-csv)

写入csv文件：

In [134]:
df.to_csv('foo.csv')

从csv文件中读取：

In [135]:
pd.read_csv('foo.csv')

     Unnamed: 0          A          B          C          D
0    2000-01-01   1.082907  -0.325267   1.501412   0.806588
1    2000-01-02  -0.390239   1.485422   1.637137  -0.287609
2    2000-01-03  -1.630259   2.181742   0.205632   0.485612
3    2000-01-04  -0.814284   0.976177  -0.041520  -2.364813
4    2000-01-05   0.346017   1.823468   0.196548  -2.183941
5    2000-01-06   0.126223   0.631177   1.162831  -1.669294
6    2000-01-07   0.420296   0.611453   1.420287  -1.438602
7    2000-01-08  -1.448791   0.174334   0.909444   0.479558
8    2000-01-09  -0.726470   0.491716   2.243013  -0.287284
9    2000-01-10  -2.493253   1.233458   2.696824  -0.098912
10   2000-01-11  -2.360882   2.448383   0.694195  -0.402914
11   2000-01-12  -3.317021   1.655499   0.220614   1.081317
12   2000-01-13  -2.078842   0.526617   1.909355   0.824377
13   2000-01-14  -0.577502  -2.757631   1.534116   1.825914
14   2000-01-15  -0.628536  -3.424130   0.428258   1.076253
15   2000-01-16  -0.386027  -3.407319  -0.660861  -0.499728
16   2000-01-17   0.093089  -4.282567   0.391214  -1.401088
17   2000-01-18  -1.814478  -2.994067  -0.086989  -1.515834
18   2000-01-19  -3.207990  -2.682761   0.304814  -0.395277
19   2000-01-20  -4.317207  -2.443054   0.462006  -2.139112
20   2000-01-21  -5.973586  -3.610452   1.302625  -2.240089
21   2000-01-22  -4.640426  -4.884383   2.037940  -1.600981
22   2000-01-23  -4.248220  -6.927911   3.497491  -3.671478
23   2000-01-24  -4.053939  -9.194235   3.996642  -1.591770
24   2000-01-25  -4.446411 -11.121203   4.572510  -2.457533
25   2000-01-26  -5.186590 -10.054767   5.703868  -0.717003
26   2000-01-27  -6.975257  -9.760684   5.103802  -1.817393
27   2000-01-28  -6.966099  -9.996140   5.439866  -1.993961
28   2000-01-29  -7.135128 -10.895678   5.820445  -1.662442
29   2000-01-30  -6.671058 -10.581426   6.590109  -1.590529
..          ...        ...        ...        ...        ...
970  2002-08-28 -24.855846 -64.893788 -51.369954 -14.761095
971  2002-08-29 -24.133857 -65.711824 -51.455660 -15.987826
972  2002-08-30 -24.903995 -65.701684 -51.867143 -16.648941
973  2002-08-31 -26.656935 -66.154515 -50.559595 -16.202978
974  2002-09-01 -29.013040 -66.200206 -51.096939 -16.823300
975  2002-09-02 -29.208242 -66.483606 -50.999569 -17.191903
976  2002-09-03 -29.426409 -67.104961 -50.022280 -15.673341
977  2002-09-04 -28.830741 -66.191113 -50.422663 -14.930490
978  2002-09-05 -28.238567 -63.952420 -51.613794 -15.146274
979  2002-09-06 -26.241322 -63.400261 -50.134051 -16.590744
980  2002-09-07 -26.163171 -63.475275 -50.698776 -16.797731
981  2002-09-08 -27.547412 -64.421646 -51.708649 -16.045778
982  2002-09-09 -28.924865 -66.134762 -51.365990 -16.608699
983  2002-09-10 -27.414578 -66.344535 -51.614181 -16.481718
984  2002-09-11 -27.336475 -64.404186 -52.810833 -15.312977
985  2002-09-12 -28.390124 -63.877958 -54.247530 -15.902703
986  2002-09-13 -29.458357 -63.229419 -54.920337 -14.257208
987  2002-09-14 -29.985167 -62.539700 -54.715688 -14.251853
988  2002-09-15 -30.398369 -62.910940 -53.614339 -14.299855
989  2002-09-16 -29.304959 -62.555394 -54.171977 -14.159070
990  2002-09-17 -29.842844 -62.628072 -53.355462 -13.359068
991  2002-09-18 -28.653425 -61.718701 -51.314580 -12.859732
992  2002-09-19 -29.267362 -61.660742 -50.683900 -11.481917
993  2002-09-20 -27.515315 -63.868932 -50.827311 -11.152452
994  2002-09-21 -26.541846 -64.284543 -51.494623 -11.322065
995  2002-09-22 -25.661374 -65.026010 -51.538649 -13.639199
996  2002-09-23 -26.225626 -62.956159 -52.396281 -13.955707
997  2002-09-24 -26.480931 -63.022269 -52.637981 -14.701805
998  2002-09-25 -26.083261 -62.062299 -52.518720 -13.822675
999  2002-09-26 -26.353005 -61.762479 -52.643215 -15.084380

[1000 rows x 5 columns]

- HDF5：参考 [HDFStores](http://pandas.pydata.org/pandas-docs/stable/io.html#io-hdf5)

写入HDF5存储：

In [136]:
df.to_hdf('foo.h5', 'df')

从HDF5存储中读取：

In [138]:
pd.read_hdf('foo.h5', 'df')

                    A          B          C          D
2000-01-01   1.082907  -0.325267   1.501412   0.806588
2000-01-02  -0.390239   1.485422   1.637137  -0.287609
2000-01-03  -1.630259   2.181742   0.205632   0.485612
2000-01-04  -0.814284   0.976177  -0.041520  -2.364813
2000-01-05   0.346017   1.823468   0.196548  -2.183941
2000-01-06   0.126223   0.631177   1.162831  -1.669294
2000-01-07   0.420296   0.611453   1.420287  -1.438602
2000-01-08  -1.448791   0.174334   0.909444   0.479558
2000-01-09  -0.726470   0.491716   2.243013  -0.287284
2000-01-10  -2.493253   1.233458   2.696824  -0.098912
2000-01-11  -2.360882   2.448383   0.694195  -0.402914
2000-01-12  -3.317021   1.655499   0.220614   1.081317
2000-01-13  -2.078842   0.526617   1.909355   0.824377
2000-01-14  -0.577502  -2.757631   1.534116   1.825914
2000-01-15  -0.628536  -3.424130   0.428258   1.076253
2000-01-16  -0.386027  -3.407319  -0.660861  -0.499728
2000-01-17   0.093089  -4.282567   0.391214  -1.401088
2000-01-18  -1.814478  -2.994067  -0.086989  -1.515834
2000-01-19  -3.207990  -2.682761   0.304814  -0.395277
2000-01-20  -4.317207  -2.443054   0.462006  -2.139112
2000-01-21  -5.973586  -3.610452   1.302625  -2.240089
2000-01-22  -4.640426  -4.884383   2.037940  -1.600981
2000-01-23  -4.248220  -6.927911   3.497491  -3.671478
2000-01-24  -4.053939  -9.194235   3.996642  -1.591770
2000-01-25  -4.446411 -11.121203   4.572510  -2.457533
2000-01-26  -5.186590 -10.054767   5.703868  -0.717003
2000-01-27  -6.975257  -9.760684   5.103802  -1.817393
2000-01-28  -6.966099  -9.996140   5.439866  -1.993961
2000-01-29  -7.135128 -10.895678   5.820445  -1.662442
2000-01-30  -6.671058 -10.581426   6.590109  -1.590529
...               ...        ...        ...        ...
2002-08-28 -24.855846 -64.893788 -51.369954 -14.761095
2002-08-29 -24.133857 -65.711824 -51.455660 -15.987826
2002-08-30 -24.903995 -65.701684 -51.867143 -16.648941
2002-08-31 -26.656935 -66.154515 -50.559595 -16.202978
2002-09-01 -29.013040 -66.200206 -51.096939 -16.823300
2002-09-02 -29.208242 -66.483606 -50.999569 -17.191903
2002-09-03 -29.426409 -67.104961 -50.022280 -15.673341
2002-09-04 -28.830741 -66.191113 -50.422663 -14.930490
2002-09-05 -28.238567 -63.952420 -51.613794 -15.146274
2002-09-06 -26.241322 -63.400261 -50.134051 -16.590744
2002-09-07 -26.163171 -63.475275 -50.698776 -16.797731
2002-09-08 -27.547412 -64.421646 -51.708649 -16.045778
2002-09-09 -28.924865 -66.134762 -51.365990 -16.608699
2002-09-10 -27.414578 -66.344535 -51.614181 -16.481718
2002-09-11 -27.336475 -64.404186 -52.810833 -15.312977
2002-09-12 -28.390124 -63.877958 -54.247530 -15.902703
2002-09-13 -29.458357 -63.229419 -54.920337 -14.257208
2002-09-14 -29.985167 -62.539700 -54.715688 -14.251853
2002-09-15 -30.398369 -62.910940 -53.614339 -14.299855
2002-09-16 -29.304959 -62.555394 -54.171977 -14.159070
2002-09-17 -29.842844 -62.628072 -53.355462 -13.359068
2002-09-18 -28.653425 -61.718701 -51.314580 -12.859732
2002-09-19 -29.267362 -61.660742 -50.683900 -11.481917
2002-09-20 -27.515315 -63.868932 -50.827311 -11.152452
2002-09-21 -26.541846 -64.284543 -51.494623 -11.322065
2002-09-22 -25.661374 -65.026010 -51.538649 -13.639199
2002-09-23 -26.225626 -62.956159 -52.396281 -13.955707
2002-09-24 -26.480931 -63.022269 -52.637981 -14.701805
2002-09-25 -26.083261 -62.062299 -52.518720 -13.822675
2002-09-26 -26.353005 -61.762479 -52.643215 -15.084380

[1000 rows x 4 columns]

- Excel： 参考 [MS Execl](http://pandas.pydata.org/pandas-docs/stable/io.html#io-excel)

In [139]:
df.to_excel('foo.xlsx', sheet_name='Sheet1')

从excel文件中读取：

In [140]:
pd.read_excel('foo.xlsx', 'Sheet1', index_col=None, na_values=['NA'])

                    A          B          C          D
2000-01-01   1.082907  -0.325267   1.501412   0.806588
2000-01-02  -0.390239   1.485422   1.637137  -0.287609
2000-01-03  -1.630259   2.181742   0.205632   0.485612
2000-01-04  -0.814284   0.976177  -0.041520  -2.364813
2000-01-05   0.346017   1.823468   0.196548  -2.183941
2000-01-06   0.126223   0.631177   1.162831  -1.669294
2000-01-07   0.420296   0.611453   1.420287  -1.438602
2000-01-08  -1.448791   0.174334   0.909444   0.479558
2000-01-09  -0.726470   0.491716   2.243013  -0.287284
2000-01-10  -2.493253   1.233458   2.696824  -0.098912
2000-01-11  -2.360882   2.448383   0.694195  -0.402914
2000-01-12  -3.317021   1.655499   0.220614   1.081317
2000-01-13  -2.078842   0.526617   1.909355   0.824377
2000-01-14  -0.577502  -2.757631   1.534116   1.825914
2000-01-15  -0.628536  -3.424130   0.428258   1.076253
2000-01-16  -0.386027  -3.407319  -0.660861  -0.499728
2000-01-17   0.093089  -4.282567   0.391214  -1.401088
2000-01-18  -1.814478  -2.994067  -0.086989  -1.515834
2000-01-19  -3.207990  -2.682761   0.304814  -0.395277
2000-01-20  -4.317207  -2.443054   0.462006  -2.139112
2000-01-21  -5.973586  -3.610452   1.302625  -2.240089
2000-01-22  -4.640426  -4.884383   2.037940  -1.600981
2000-01-23  -4.248220  -6.927911   3.497491  -3.671478
2000-01-24  -4.053939  -9.194235   3.996642  -1.591770
2000-01-25  -4.446411 -11.121203   4.572510  -2.457533
2000-01-26  -5.186590 -10.054767   5.703868  -0.717003
2000-01-27  -6.975257  -9.760684   5.103802  -1.817393
2000-01-28  -6.966099  -9.996140   5.439866  -1.993961
2000-01-29  -7.135128 -10.895678   5.820445  -1.662442
2000-01-30  -6.671058 -10.581426   6.590109  -1.590529
...               ...        ...        ...        ...
2002-08-28 -24.855846 -64.893788 -51.369954 -14.761095
2002-08-29 -24.133857 -65.711824 -51.455660 -15.987826
2002-08-30 -24.903995 -65.701684 -51.867143 -16.648941
2002-08-31 -26.656935 -66.154515 -50.559595 -16.202978
2002-09-01 -29.013040 -66.200206 -51.096939 -16.823300
2002-09-02 -29.208242 -66.483606 -50.999569 -17.191903
2002-09-03 -29.426409 -67.104961 -50.022280 -15.673341
2002-09-04 -28.830741 -66.191113 -50.422663 -14.930490
2002-09-05 -28.238567 -63.952420 -51.613794 -15.146274
2002-09-06 -26.241322 -63.400261 -50.134051 -16.590744
2002-09-07 -26.163171 -63.475275 -50.698776 -16.797731
2002-09-08 -27.547412 -64.421646 -51.708649 -16.045778
2002-09-09 -28.924865 -66.134762 -51.365990 -16.608699
2002-09-10 -27.414578 -66.344535 -51.614181 -16.481718
2002-09-11 -27.336475 -64.404186 -52.810833 -15.312977
2002-09-12 -28.390124 -63.877958 -54.247530 -15.902703
2002-09-13 -29.458357 -63.229419 -54.920337 -14.257208
2002-09-14 -29.985167 -62.539700 -54.715688 -14.251853
2002-09-15 -30.398369 -62.910940 -53.614339 -14.299855
2002-09-16 -29.304959 -62.555394 -54.171977 -14.159070
2002-09-17 -29.842844 -62.628072 -53.355462 -13.359068
2002-09-18 -28.653425 -61.718701 -51.314580 -12.859732
2002-09-19 -29.267362 -61.660742 -50.683900 -11.481917
2002-09-20 -27.515315 -63.868932 -50.827311 -11.152452
2002-09-21 -26.541846 -64.284543 -51.494623 -11.322065
2002-09-22 -25.661374 -65.026010 -51.538649 -13.639199
2002-09-23 -26.225626 -62.956159 -52.396281 -13.955707
2002-09-24 -26.480931 -63.022269 -52.637981 -14.701805
2002-09-25 -26.083261 -62.062299 -52.518720 -13.822675
2002-09-26 -26.353005 -61.762479 -52.643215 -15.084380

[1000 rows x 4 columns]